Revit 2027 API
View.SetBackground Method
 Sets the background for the view. Background can only be set for 3d views and for Sections/Elevations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBackground(
	ViewDisplayBackground background
)
Public Sub SetBackground (
	background As ViewDisplayBackground
)
public:
void SetBackground(
	ViewDisplayBackground^ background
)
member SetBackground :
        background : ViewDisplayBackground -> unit
Parameters
background ViewDisplayBackground
 Background to set. See 'ViewDisplayBackground' class and its 'create' methods.
Exceptions
Exception | Condition
ArgumentException |  The background object is invalid, or view has 'Rendering' style.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This view does not contain display-related properties.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace